# Basic things I'd install on any machine.

# Brew taps

tap "homebrew/cask"                      # `brew cask` for GUI apps.
tap "homebrew/cask-fonts"                # Let's you `brew cask install` fonts.
tap "homebrew/bundle"                    # Allows you to use Brewfiles.
tap "homebrew/cask-versions"             # Allows installing other versions of casks.

# Bootstrapping.

cask "1password"                         # Password manager, installed first so I can log into things.
brew "gnupg"                             # gpg command line.
cask "kitty"                             # GPU Accelerated cross-platform Terminal Emulator.
cask "font-hasklug-nerd-font"            # Nice programming font Hasklig (Source Code Pro + Ligatures) + Nerd Font extensions.
cask "rectangle"                         # Window manager that's easy to get used to.
cask "copyq"                             # Clipboard manager with history (needs manual setup).
brew "neovim"                            # New and improved vim.
brew "watch"                             # Rerun a command every n seconds.
brew "pstree"                            # Hierarchical tree of processes, `pstree -g 3`.

# Brew formulae

# brew "dockutil"                          # Add and remove things from the dock (e.g. `dockutil --remove all`).
brew "bash"                              # macOS Bash is very old.
brew "coreutils"                         # GNU versions of utils that are out-of-date or FreeBSD on macOS (inc dircolors).
brew "entr"                              # Command line file watching.
brew "expect"                            # Includes `unbuffer` for making programs think stdout/stderr is a tty.
brew "fd"                                # Super-fast find replacement.
brew "fzf"                               # Fuzzy file finder.
brew "git"                               # Bleeding-edge git.
brew "git-delta"                         # Nicer git diff viewer.
brew "gnu-sed"                           # A sed that actually supports `sed -i`.
brew "htop"                              # Terminal activity monitor.
brew "less"                              # Fixes -RX issue.
brew "macos-trash"                       # Move to Trash, aliased to `dl` in gibrc.
brew "mas"                               # Mac App Store third-party cli.
brew "node"                              # Node.js programming language.
brew "pinentry-mac"                      # Gpg password Keychain integration.
brew "python"                            # Python 3
brew "ripgrep"                           # Super-fast version of grep.
brew "terminal-notifier"                 # Log notifications from the terminal.
brew "tree"                              # Recursive ls.
brew "zoxide"                            # Z (for changing directory) but in Rust.
brew "zsh"                               # Nicer interactive shell.

# Brew casks (GUI Applications):

# cask "google-chrome"                     # You probably want/have Chrome.
# cask "karabiner-elements"                # Key remapper (see $c/karabiner/karabiner.json for my settings).
# cask "steam"                             # Play games on macOS.
cask "hammerspoon"                       # Scriptable automator for macOS.
cask "keyboard-cleaner"                  # Block all keystrokes except ⌘-q so you can wipe your keyboard.
cask "sogouinput"                        # Nicer Chinese input experience.
cask "spotify"                           # Music.
cask "time-out"                          # Reminds you to take breaks.
cask "vlc"                               # Nice video player.
cask "wechat"                            # Chinese chat client.
cask "workflowy"                         # Infinitely nested bullet point list app.

# Mac App Store Apps (some paid). `mas list` to see what you've already installed.

mas "Pages", id: 409201541               # Edit docx and pages files.
mas "Runcat", id: 1429033973             # Show CPU usage in menu bar.
mas "Dato", id: 1470584107
