# Basic things I'd install on any machine.

# Brew taps

tap "homebrew/cask"                      # `brew cask` for GUI apps.
tap "homebrew/cask-fonts"                # Let's you `brew cask install` fonts.
tap "homebrew/bundle"                    # Allows you to use Brewfiles.
tap "homebrew/cask-versions"             # Allows installing other versions of casks.

# Brew formulae

brew "bash"                              # macOS Bash is very old.
brew "coreutils"                         # GNU versions of utils that are out-of-date or FreeBSD on macOS (inc dircolors).
brew "entr"                              # Command line file watching.
brew "fd"                                # Super-fast find replacement.
brew "fzf"                               # Fuzzy file finder.
brew "git"                               # Bleeding-edge git.
brew "git-delta"                         # Nicer git diff viewer.
brew "gnu-sed"                           # A sed that actually supports `sed -i`.
brew "gnupg"                             # gpg command line.
brew "htop"                              # Terminal activity monitor.
brew "less"                              # Fixes -RX issue.
brew "mas"                               # Mac App Store third-party cli.
brew "neovim"                            # New and improved vim.
brew "node"                              # Node.js programming language.
brew "pinentry-mac"                      # Gpg password Keychain integration.
brew "python"                            # Python 3
brew "ripgrep"                           # Super-fast version of grep.
brew "rmtrash"                           # `rm` to Trash, aliased to `dl` in gibrc.
brew "terminal-notifier"                 # Log notifications from the terminal.
brew "tree"                              # Recursive ls.
brew "zsh"                               # Nicer interactive shell.

# Brew casks (GUI Applications):

# cask "rectangle"                         # Window manager that's easy to get used to.
cask "1password"                         # Password manager.
cask "copyq"                             # Clipboard manager with history (needs manual setup).
cask "font-hasklig"                      # Nicer programming font option 2.
cask "google-chrome"                     # You probably want/have Chrome.
cask "karabiner-elements"                # Key remapper (see $c/karabiner/karabiner.json for my settings).
cask "keyboard-cleaner"                  # Block all keystrokes except ⌘-q so you can wipe your keyboard.
cask "kitty"                             # GPU Accelerated cross-platform Terminal Emulator.
cask "sogouinput"                        # Nicer Chinese input experience.
cask "spectacle"                         # Window manager that's easy to get used to.
cask "spotify"                           # Music.
cask "steam"                             # Play games on macOS.
cask "time-out"                          # Reminds you to take breaks.
cask "wechat"                            # Chinese chat client.
cask "workflowy"                         # Infinitely nested bullet point list app.

# Mac App Store Apps (some paid). `mas list` to see what you've already installed.

mas "Pages", id: 409201541               # Edit docx and pages files.
mas "Runcat", id: 1429033973             # Show CPU usage in menu bar.
