# Basic things I'd install on any machine.

# Brew taps

tap "homebrew/bundle"                    # Allows you to use Brewfiles.

# Bootstrapping.

cask "1password"                         # Password manager, installed first so I can log into things.
brew "gnupg"                             # gpg command line.
cask "kitty"                             # GPU Accelerated cross-platform Terminal Emulator.
cask "font-hasklug-nerd-font"            # Nice programming font Hasklig (Source Code Pro + Ligatures) + Nerd Font extensions.
cask "hammerspoon"                       # Scriptable automator for macOS.
cask "maccy"                             # Clipboard manager with history.
brew "neovim"                            # New and improved vim.
brew "watch"                             # Rerun a command every n seconds.
brew "pstree"                            # Hierarchical tree of processes, `pstree -g 3`.

# Brew formulae

brew "bash"                              # macOS Bash is very old.
brew "coreutils"                         # GNU versions of utils that are out-of-date or FreeBSD on macOS (inc dircolors).
brew "expect"                            # Includes `unbuffer` for making programs think stdout/stderr is a tty.
brew "fd"                                # Super-fast find replacement.
brew "fzf"                               # Fuzzy file finder.
brew "git"                               # Bleeding-edge git.
brew "git-delta"                         # Nicer git diff viewer.
brew "gnu-sed"                           # A sed that actually supports `sed -i`.
brew "htop"                              # Terminal activity monitor.
brew "less"                              # Fixes -RX issue.
brew "macos-trash"                       # Move to Trash, aliased to `dl` in zshrc.
brew "mas"                               # Mac App Store third-party cli.
brew "node"                              # Node.js programming language.
brew "pinentry-mac"                      # Gpg password Keychain integration.
brew "python"                            # Python 3
brew "ripgrep"                           # Super-fast version of grep.
brew "terminal-notifier"                 # Log notifications from the terminal.
brew "tree"                              # Recursive ls.
brew "volta"                             # Node version manager.
brew "watchexec"                         # Run commands when files change.
brew "zoxide"                            # Z (for changing directory) but in Rust.
brew "zsh"                               # Nicer interactive shell.

# Brew casks (GUI Applications):

cask "google-chrome"                     # You probably want/have Chrome.
cask "keyboard-cleaner"                  # Block all keystrokes except ⌘-q so you can wipe your keyboard.
cask "spotify"                           # Music.
cask "time-out"                          # Reminds you to take breaks.
cask "visual-studio-code"                # Used to teach Brian to code.
cask "vlc"                               # Nice video player.
cask "wechat"                            # Chinese chat client.
cask "whatsapp"                          # Whatsapp client.
cask "workflowy"                         # Infinitely nested bullet point list app.

# Mac App Store Apps (some paid). `mas list` to see what you've already installed.

# mas "Runcat", id: 1429033973             # Show CPU usage in menu bar.
mas "Dato", id: 1470584107
mas "Pages", id: 409201541               # Edit docx and pages files.
mas "1Password for Safari", id: 1569813296 # 1Password browser extension.
mas "Dark Reader for Safari", id: 1438243180 # Dark mode in every website.
