# Things I use on my development machine. Commented lines are things I have
# previously used but don't currently.

# Brew taps

tap "gibfahn/tap", "https://github.com/gibfahn/homebrew-tap" # My personal tap for misc things.

# Brew formulae

# brew "asciinema"                         # Screen recorder for the terminal.
# brew "bandwhich"                         # See what's using bandwidth on your machine.
# brew "exercism"                          # Learn coding languages.
# brew "graphviz"                          # Gives you the `dot` tool for generating diagrams.
# brew "hexyl"                             # Hex viewer in Rust.
# brew "pv"                                # Show data flow through bash pipes.
# brew "xsv"                               # csv manipulator.
# cask "balenaetcher"                      # Flash disk images (e.g. Linux bootable USB sticks).
# cask "disk-inventory-x"                  # Graphical view of what's taking up disk space.
# cask "geektool"                          # Display things on Desktop (I have a todo list).
# cask "grandperspective"                  # Alternative to disk-inventory-x, shows disk space usage.
brew "bat"                               # Nicer cat with syntax highlighting etc.
brew "binutils"                          # GNU versions of tools for interacting with binaries (nm, strings etc).
brew "bob"                               # Neovim version manager.
brew "buildifier"                        # Bazel code formatter.
brew "buildozer"                         # Automatically apply fixes to bazel files.
brew "cargo-edit"                        # Gives `cargo {add,rm,upgrade}` commands.
brew "cargo-nextest"                     # Parallel test runner framework.
brew "cobalt"                            # Static site generator (https://cobalt-org.github.io/).
brew "dfu-programmer"                    # QMK dependency used for flashing my Ergodox Infinity.
brew "dfu-util"                          # QMK dependency used for flashing my Ergodox Infinity.
brew "pipx"                              # Install Python binaries (https://pipx.pypa.io).
brew "diffutils"                         # GNU versions of diff and related tools.
brew "findutils"                         # GNU versions of find, locate, updatedb, xargs.
brew "fswatch"                           # See which files are opened on the system (`fswatch /`).
brew "gawk"                              # GNU versions of awk.
brew "gh"                                # New GitHub CLI (will eventually replace hub).
brew "git-cliff"                         # Changelog generator.
brew "git-lfs"                           # Git Large File Storage. Use with `git lfs`.
brew "gnu-tar"                           # GNU version of tar.
brew "gnu-time"                          # GNU version of time.
brew "gnu-which"                         # GNU version of which.
brew "go"                                # Go progamming language.
brew "grep"                              # GNU version of grep.
brew "hyperfine"                         # Benchmark commands (time but a benchmarking suite).
brew "lazygit"                           # Git TUI wrapper, has some staging niceties etc.
brew "jq"                                # Makes it easy to deal with JSON on the command line.
brew "ijq"                               # Interactive jq
brew "kubectx"                           # Easily change Kubernetes context or namespace.
brew "kubernetes-cli"                    # Manage your docker clusters with kube.
brew "make"                              # GNU version of make.
brew "moreutils"                         # GNU tools like parallel and sponge.
brew "protobuf"                          # Serialization format.
brew "ruby"                              # Newer version of Ruby.
brew "shellcheck"                        # Linter for bash.
brew "shfmt"                             # Shell script formatter.
brew "tidy-html5"                        # HTML5 linter.
brew "tokei"                             # Counts lines of code in a project.
brew "wget"                              # Alternative to curl for downloading files.

# Brew formulae from taps.

# brew "gibfahn/tap/check-sieve"           # Linter for sieve email filter files.

# Brew casks

# cask "gimp"                              # Heavyweight photo editor.
# cask "intellij-idea-ce"                  # Java-oriented IDE (good for debugging).
# cask "meld"                              # Visual file diffing tool.
# cask "messenger"                         # Facebook Messenger native app.
# cask "microsoft-teams"                   # Microsoft Teams
# cask "onedrive"                          # Microsoft OneDrive.
cask "1password-cli"                     # CLI way to access 1Password credentials.
cask "arc"                               # Nicer browser.
cask "chrysalis"                         # Used to flash my KeyboardIO Model 01.
cask "daisydisk"                         # See what's using disk space and easily clean it up.
cask "docker"                            # Build and run docker images.
cask "keycastr"                          # Shows keystrokes in corner of screen (great for casting/demos).
cask "obsidian"                          # Markdown-based note-taking app.
cask "slack"                             # Everyone uses Slack right?
cask "zoom"                              # Zoom web meetings client.

# Mac App Store Apps (some paid). `mas list` to see what you've already installed.

# mas "Xcode", id: 497799835 # Needed to compile llvm (among other things).
# mas "Final Cut Pro", id: 424389933
# mas "GarageBand", id: 682658836
# mas "Logic Pro X", id: 634148309
# mas "iMovie", id: 408981434

mas "GhostText", id: 1552641506 # Edit textboxes from neovim.
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pocket", id: 568494494
mas "Refined GitHub", id: 1519867270     # Better GitHub interactions.
mas "Save to Pocket", id: 1477385213

# vi: filetype=conf
