# Things I use on my development machine. Commented lines are things I have
# previously used but don't currently.

# Brew taps

tap "gibfahn/tap" # My personal tap for misc things.

# Brew formulae

brew "bat"                               # Nicer cat with syntax highlighting etc.
brew "binutils"                          # GNU versions of tools for interacting with binaries (nm, strings etc).
brew "black"                             # Python code formatter.
brew "bob"                               # Neovim version manager.
brew "buildifier"                        # Bazel code formatter.
brew "buildozer"                         # Automatically apply fixes to bazel files.
brew "cargo-edit"                        # Gives `cargo {add,rm,upgrade}` commands.
brew "cargo-nextest"                     # Parallel test runner framework.
brew "cobalt"                            # Static site generator (https://cobalt-org.github.io/).
brew "dfu-programmer"                    # QMK dependency used for flashing my Ergodox Infinity.
brew "dfu-util"                          # QMK dependency used for flashing my Ergodox Infinity.
brew "diffutils"                         # GNU versions of diff and related tools.
brew "findutils"                         # GNU versions of find, locate, updatedb, xargs.
brew "fswatch"                           # See which files are opened on the system (`fswatch /`).
brew "gawk"                              # GNU versions of awk.
brew "git-absorb"                        # Easily absorb a change into the git commit that touched the same files.
brew "git-cliff"                         # Changelog generator.
brew "git-lfs"                           # Git Large File Storage. Use with `git lfs`.
brew "gnu-tar"                           # GNU version of tar.
brew "gnu-time"                          # GNU version of time.
brew "gnu-which"                         # GNU version of which.
brew "go"                                # Go programming language.
brew "grep"                              # GNU version of grep.
brew "hyperfine"                         # Benchmark commands (time but a benchmarking suite).
brew "ijq"                               # Interactive jq
brew "jq"                                # Makes it easy to deal with JSON on the command line.
brew "kubectx"                           # Easily change Kubernetes context or namespace.
brew "kubernetes-cli"                    # Manage your docker clusters with kube.
brew "lazygit"                           # Git TUI wrapper, has some staging niceties etc.
brew "make"                              # GNU version of make.
brew "moreutils"                         # GNU tools like parallel and sponge.
brew "mypy"                              # Python code typechecker.
brew "pkl"                               # Pkl config language (https://pkl-lang.org).
brew "pkl-lsp"                           # Language server for the Pkl config language (https://pkl-lang.org).
brew "protobuf"                          # Serialization format.
brew "pylint"                            # Python code linter.
brew "ruby"                              # Newer version of Ruby.
brew "shellcheck"                        # Linter for bash.
brew "shfmt"                             # Shell script formatter.
brew "tidy-html5"                        # HTML5 linter.
brew "tokei"                             # Counts lines of code in a project.
brew "typos-cli"                         # Detect typos in code.
brew "uv"                                # Python wrapper for doing python stuff.
brew "wget"                              # Alternative to curl for downloading files.

# Brew formulae from taps.

brew "gibfahn/tap/up"                    # Handles updating everything (installed here for man pages and completions).


# Brew casks

# cask "docker"                            # Build and run docker images.
# cask "gimp"                              # Heavyweight photo editor.
# cask "intellij-idea-ce"                  # Java-oriented IDE (good for debugging).
# cask "meld"                              # Visual file diffing tool.
# cask "messenger"                         # Facebook Messenger native app.
# cask "microsoft-teams"                   # Microsoft Teams
# cask "onedrive"                          # Microsoft OneDrive.
# cask "zoom"                              # Zoom web meetings client.
# cask "arc"                               # Nicer browser.
cask "chrysalis"                         # Used to flash my KeyboardIO Model 01.
cask "daisydisk"                         # See what's using disk space and easily clean it up.
cask "ghostty"                           # Backup terminal for when I have issues with kitty.
cask "keycastr"                          # Shows keystrokes in corner of screen (great for casting/demos).
cask "macwhisper"                        # Speech recognition tool.
cask "obsidian"                          # Markdown-based note-taking app.
cask "slack"                             # Everyone uses Slack right?
cask "visual-studio-code"                # Used to teach Brian to code.

# Mac App Store Apps (some paid). `mas list` to see what you've already installed.

# mas "Final Cut Pro", id: 424389933
# mas "GarageBand", id: 682658836
# mas "Logic Pro X", id: 634148309
mas "Refined GitHub", id: 1519867270     # Better GitHub interactions (broken on GHE: https://github.com/refined-github/refined-github/issues/8405).
# mas "Xcode", id: 497799835 # Needed to compile llvm (among other things).
# mas "iMovie", id: 408981434

mas "GhostText", id: 1552641506 # Edit textboxes from neovim.
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825

# vi: filetype=conf
