# Things I use on my development machine. Commented lines are things I have
# previously used but don't currently.

# Brew formulae

# brew "bash-completion"                   # Generally useful bash completions.
# brew "ccache"                            # Speeds up C/C++ recompilation.
# brew "certbot"                           # LetsEncrypt.
# brew "cmake"                             # Commonly-used meta build system.
# brew "ctags"                             # Used for autocomplete in Vim (etc).
# brew "exa"                               # Nicer ls replacement.
# brew "exercism"                          # Learn coding languages.
# brew "graphviz"                          # Gives you the `dot` tool for generating diagrams.
# brew "groovy"                            # Helpful for testing Jenkins scripts.
# brew "hexyl"                             # Hex viewer in Rust.
# brew "ipython"                           # Interactive python shell.
# brew "kakoune"                           # Nicer but WIP alternative to neovim.
# brew "kubernetes-helm"                   # Package manager for Docker.
# brew "ninja"                             # Google meta build system (used in V8).
# brew "redis"                             # In-memory key-object store.
# brew "tmux"                              # Terminal multiplexer.
# brew "watchexec"                         # Like entr (evaluating which one is better).
# brew "xsv"                               # csv manipulator.
# cask "balenaetcher"                      # Flash disk images (e.g. Linux bootable USB sticks).
# cask "disk-inventory-x"                  # Graphical view of what's taking up disk space.
# cask "font-fira-code"                    # Nicer programming font option 1.
# cask "font-source-code-pro"              # Nicer programming font option 3.
# cask "geektool"                          # Display things on Desktop (I have a todo list).
# cask "grandperspective"                  # Alternative to disk-inventory-x, shows disk space usage.
# cask "vagrant"                           # Quick command-line image spin-up.
# cask "virtualbox"                        # Manage VMs (Linux or Windows).
# cask "vulkan-sdk"                        # Use the vulkan graphics APIs on macOS.
brew "asciinema"                         # Screen recorder for the terminal.
brew "bandwhich"                         # See what's using bandwidth on your machine.
brew "bat"                               # Nicer cat with syntax highlighting etc.
brew "binutils"                          # GNU versions of tools for interacting with binaries (nm, strings etc).
brew "broot"                             # Interactive version of "tree".
brew "buildifier"                        # Bazel code formatter.
brew "dfu-programmer"                    # QMK dependency used for flashing my Ergodox Infinity.
brew "dfu-util"                          # QMK dependency used for flashing my Ergodox Infinity.
brew "diffutils"                         # GNU versions of diff and related tools.
brew "findutils"                         # GNU versions of find, locate, updatedb, xargs.
brew "fswatch"                           # See which files are opened on the system (`fswatch /`).
brew "gawk"                              # GNU versions of awk.
brew "gdub"                              # Wrapper around ./gradlew for gradle projects (gw).
brew "gh"                                # New GitHub CLI (will eventually replace hub).
brew "git-lfs"                           # Git Large File Storage. Use with `git lfs`.
brew "gnu-tar"                           # GNU version of tar.
brew "gnu-time"                          # GNU version of time.
brew "gnu-which"                         # GNU version of which.
brew "gnutls"                            # Provides gnutls-cli for setting up TLS connections.
brew "go"                                # Go progamming language.
brew "grep"                              # GNU version of grep.
brew "httpie"                            # Alternative to curl, `http` binary.
brew "hyperfine"                         # Benchmark commands (time but a benchmarking suite).
brew "jq"                                # Makes it easy to deal with JSON on the command line.
brew "kubectx"                           # Easily change Kubernetes context or namespace.
brew "kubernetes-cli"                    # Manage your docker clusters with kube.
brew "make"                              # GNU version of make.
brew "moreutils"                         # GNU tools like parallel and sponge.
brew "postgresql"                        # Solid database.
brew "protobuf"                          # Serialization format.
brew "pv"                                # Show data flow through bash pipes.
brew "ruby"                              # Newer version of Ruby.
brew "sd"                                # Nicer sed.
brew "shellcheck"                        # Linter for bash.
brew "speedtest-cli"                     # Check network speed from the command-line.
brew "tokei"                             # Counts lines of code in a project.
brew "wget"                              # Alternative to curl for downloading files.

# Brew formulae from taps.

brew "bazelisk"                          # Easily use the latest version of bazel.
brew "buildozer"                         # Automatically apply fixes to bazel files.

# Brew casks

# cask "adoptopenjdk8"                     # Java 8 that is still supported.
# cask "gimp"                              # Heavyweight photo editor.
# cask "intellij-idea-ce"                  # Java-oriented IDE (good for debugging).
# cask "trailer"                           # GitHub push notifications.
# cask "visual-studio-code"                # IDE that supports debugging Rust code.
cask "chrysalis"                         # Used to flash my KeyboardIO Model 01.
cask "daisydisk"                         # See what's using disk space and easily clean it up.
cask "docker"                            # Build and run docker images.
cask "firefox-nightly"                   # For those sweet Rust-based improvements.
cask "hyperswitch"                       # Better Cmd-Tab (only windows on a screen).
cask "keycastr"                          # Shows keystrokes in corner of screen (great for casting/demos).
cask "meld"                              # Visual file diffing tool.
cask "messenger"                           # Facebook Messenger native app.
cask "slack-beta"                        # Everyone uses Slack right?
cask "stay"                              # Save and restore window positions, invaluable with multi-monitor setups.
cask "vimr"                              # GUI neovim.

# Mac App Store Apps (some paid). `mas list` to see what you've already installed.

# mas "Final Cut Pro", id: 424389933
# mas "GarageBand", id: 682658836
# mas "Logic Pro X", id: 634148309
# mas "Xcode", id: 497799835               # Needed to compile llvm (among other things).
# mas "iMovie", id: 408981434
mas "Be Focused", id: 973134470          # Pomodoro Timer.
mas "Dark Reader for Safari", id: 1438243180 # Dark mode in every website.
# mas "Dato", id: 1470584107
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "RunCat", id: 1429033973
mas "Save to Pocket", id: 1477385213

# vi: filetype=conf
