# vi: filetype=conf

tap "srkomodo/tap"                       # ShadowFox Firefox Universal Dark Theme

brew "asciinema"                         # Take screen recordings of your terminal (https://asciinema.org).
brew "certbot"                           # LetsEncrypt.
brew "dfu-util"                          # Used for flashing my Ergodox Infinity.
brew "exercism"                          # Learn coding languages.
brew "gdub"                              # Wrapper around ./gradlew for gradle projects (gw).
brew "git-lfs"                           # Git Large File Storage. Use with `git lfs`.
brew "go"                                # Go progamming language.
brew "ninja"                             # Google meta build system (used in V8).
brew "postgresql"                        # Solid database.
brew "protobuf"                          # Serialization format.
brew "shellcheck"                        # Linter for bash.
brew "redis"                             # In-memory key-object store.
brew "srkomodo/tap/shadowfox-updater"    # ShadowFox Firefox Universal Dark Theme Updater (`shadowfox` to install).
brew "watchexec"                         # Like entr (evaluating which one is better).
cask "1password"                         # Password manager.
cask "caprine"                           # Facebook Messenger native app.
cask "firefox-nightly"                   # For those sweet Rust-based improvements.
cask "geektool"                          # Display things on Desktop (I have a todo list).
cask "gimp"                              # Heavyweight photo editor.
cask "intellij-idea"                     # Java-oriented IDE (good for debugging).
cask "karabiner-elements"                # Key remapper (see $c/karabiner/karabiner.json for my settings).
cask "keycastr"                          # Shows keystrokes in corner of screen (great for casting/demos).
cask "kitty"                             # GPU Accelerated cross-platform Terminal Emulator.
cask "slack-beta"                        # Everyone uses Slack right?
cask "sogouinput"                        # Nicer Chinese input experience.
cask "spotify"                           # Music.
cask "stay"                              # Save and restore window positions, invaluable with multi-monitor setups.
cask "time-out"                          # Reminds you to take breaks.
cask "workflowy"                         # Infinitely nested bullet point list app.
# brew "cmake"                             # Commonly-used meta build system.
# brew "ctags"                             # Used for autocomplete in Vim (etc).
# brew "exa"                               # Nicer ls replacement.
# brew "groovy"                            # Helpful for testing Jenkins scripts.
# brew "kubernetes-cli"                    # Manage your docker clusters with kube.
# brew "kubernetes-helm"                   # Package manager for Docker.
# cask "vagrant"                           # Quick command-line image spin-up.
# cask "virtualbox"                        # Manage VMs (Linux or Windows).
# cask "vulkan-sdk"                        # Use the vulkan graphics APIs on macOS.

# Chunkwm Window Manager (currently disabled):
# tap "crisidev/homebrew-chunkwm"
# brew "chunkwm", restart_service: :changed
# brew "koekeishiya/formulae/khd", restart_service: :changed

# Mac App Store Apps (some paid). `mas list` to see what you've already installed.
mas "Keynote", id: 409183694
mas "Dark Reader for Safari", id: 1438243180 # Dark mode in every website.
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Xcode", id: 497799835               # Needed to compile llvm (among other things).
# mas "Numbers", id: 409203825
# mas "Final Cut Pro", id: 424389933
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Logic Pro X", id: 634148309

brew "llvm"                              # Gives clangd (clang language server).
