# Basic things I'd install on any machine.

tap "homebrew/cask"                      # `brew cask` for GUI apps.
tap "homebrew/cask-fonts"                # Let's you `brew cask install` fonts.
tap "homebrew/bundle"                    # Allows you to use Brewfiles.
tap "homebrew/cask-versions"             # Allows installing other versions of casks.

# Versions of utils that are out-of-date on macOS:
# Defaults are in /usr/bin, brew installs to /usr/local/bin

brew "bash"                              # macOS Bash is very old.
brew "git"                               # Bleeding-edge git.
brew "less"                              # Fixes -RX issue.
brew "python"                            # Python 3
brew "python2"                           # Python 2
brew "zsh"                               # Nicer interactive shell.

# GNU versions of utils that are out-of-date or FreeBSD on macOS:

brew "binutils"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "gawk"
brew "gnu-sed"                           # A sed that actually supports `sed -i`.
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnutls"
brew "grep"
brew "htop"                              # Terminal activity monitor.
brew "make"
brew "tree"                              # Recursive ls.
brew "wget"

# Command-line helpers:

brew "entr"                              # Command line file watching.
brew "fd"                                # Super-fast find replacement.
brew "gnupg"                             # gpg command line.
brew "mas"                               # Mac App Store third-party cli.
brew "neovim"                            # New and improved vim.
brew "pinentry-mac"                      # Gpg password Keychain integration.
brew "ripgrep"                           # Super-fast version of grep.
brew "rmtrash"                           # `rm` to Trash, aliased to `dl` in gibrc.
brew "terminal-notifier"                 # Log notifications from the terminal.

# Casks (GUI Applications):

cask "copyq"                             # Clipboard manager with history (needs manual setup).
cask "font-hasklig"                      # Nicer programming font option 2.
cask "google-chrome"                     # You probably want/have Chrome.
cask "kitty"                             # GPU Accelerated cross-platform Terminal Emulator.
cask "sogouinput"                        # Nicer Chinese input experience.
cask "workflowy"                         # Infinitely nested bullet point list app.
cask "time-out"                          # Reminds you to take breaks.
cask "karabiner-elements"                # Key remapper (see $c/karabiner/karabiner.json for my settings).
cask "keyboard-cleaner"                  # Block all keystrokes except ⌘-q so you can wipe your keyboard.
cask "1password"                         # Password manager.
cask "rectangle"                         # Window manager that's easy to get used to.
